// 系统角色
const sysytem_users_roles = [
  '系统管理员',
  'HR',
  '面试官',
  '用人部门负责人',
]
// 供应商
const supplier = [
  '全部供应商',
  '文思海辉',
  '中软',
]
// 需求方
const userOrganization = [
  '全部用人方',
  '中国平安',
  '阿里巴巴',
  'SAP',
]
// 技术方向 | 应聘岗位 | 职位名称
const jobs = [
  '全部职位',
  '前端',
  'web前端',
  'HTML5',
  'Node.js',
  'JavaScript',
  'Android',
  'iOS',
  'U3D',
  'COCOS2DX',
  '前端架构师',

  '后端',
  'JAVA工程师',
  'PHP',
  'C++',
  '.NET',
  'C#',
  'Python',
  '架构师',

  '数据',
  '数据挖掘',
  '算法工程师',
  '数据分析师',
  '数据架构师',
  '算法研究员',

  '测试',
  '测试工程师',
  '自动化测试',
  '功能测试',
  '性能测试',
  '测试开发',
  '移动端测试',
  '游戏测试',
  '硬件测试',
  '软件测试',

  '运维/技术支持',
  '运维工程师',
  '运维开发工程师',
  '网络工程师',
  '系统工程师',
  'IT技术支持',
  '系统管理员',
  '网络安全',
  '系统安全',

  '项目管理',
  '项目经理',
  '项目助理',

  '产品',
  '产品经理',
  '网页产品经理',
  '移动产品经理',
  '产品助理',

  '设计',
  '视觉设计',
  '网页设计师',
  'APP设计师',
  'UI设计师',
  '平面设计师',
  '美工',
  '设计师助理',

  '交互设计',
  '交互设计师',
  '无线交互设计师',
  '网页交互设计师',
  '硬件交互设计师',
  'UX设计师',
  '用户研究员',

  '其他',
  '人事助理',
  '助理专员',
]

// 面试流程
const interviewerProcess = [
  '新增候选人',
  '初选通过',
  '内面',
  '客户简历筛选',
  '客户面试',
  '机考',
  '入场',
  '已淘汰',
]
// 招聘流程
const positionProcess = [
  '招聘中',
  '停止招聘',
]
// 日程流程
const calendarProcess = [
  '安排面试',
  '安排机考',
  '安排入场',
]
// 状态
const interviewerStatus = [
  '无需求',
  '不符合',
  '不符合',
  '放弃',
  '进行中',
  '成功入场',
]
// 工作性质
const jobCategory = [
  '全职',
  '兼职',
  '实习'
]
// 工作经验要求
const workingYears = [
  '不限',
  '1年以下',
  '1-3年',
  '3-5年',
  '5-10年',
  '10年以上',
]
// 级别 | 职级
const rankLevel = [
  '初级',
  '中级',
  '高级',
]
// 最高学历 | 学历要求
const maxEducation = [
  '硕士及以上',
  '本科',
  '大专',
  '大专以下',
]
// 面试官
const interviewer = [
  '张三',
  '李四',
  '小虎',
]
